nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1186/driver_examples/sramc/sram_controller/pin_mux.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

 #ifndef _PIN_MUX_H_
 #define _PIN_MUX_H_
 
 /*!
  * @addtogroup pin_mux
  * @{
  */
 
 /***********************************************************************************************************************
  * API
  **********************************************************************************************************************/
 
 #if defined(__cplusplus)
 extern "C" {
 #endif
 
 /*!
  * @brief Calls initialization functions.
  *
  */
 void BOARD_InitBootPins(void);

  /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitSramcPins(void);
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitDEBUG_UARTPins(void);          /* Function assigned for the Cortex-M33 */
 
 /*!
  * @brief This is a de-initialization function for 'BOARD_InitDEBUG_UARTPins' function.
  * It sets all pins features (routing, direction and electrical) to their after-reset state.
  * It also tries to route the previous peripheral signals to their default pins.
  *
  */
 void BOARD_InitDEBUG_UARTPins_deinit(void);   /* Function assigned for the Cortex-M33 */

 #if defined(__cplusplus)
 }
 #endif
 
 /*!
  * @}
  */
 #endif /* _PIN_MUX_H_ */
 
 /***********************************************************************************************************************
  * EOF
  **********************************************************************************************************************/
 